/* Automatic Update Alert Description (Critical Update) */
"%1$@ %2$@ has been downloaded and is ready to use! This is an important update; would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ ได้ถูกดาวน์โหลดเรียบร้อยแล้วและพร้อมใช้งาน! นี่เป็นการอัพเดตสำคัญ; คุณต้องการจะติดตั้งอัพเดตนี้และให้ใช้งาน %1$@ อีกครั้งตอนนี้หรือไม่?";

/* Automatic Update Alert Description (Normal Update) */
"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ ได้ถูกดาวน์โหลดเรียบร้อยแล้วและพร้อมใช้งาน! คุณต้องการจะติดตั้งอัพเดตมันและใช้งาน %1$@ อีกครั้งตอนนี้หรือไม่?";

/* No comment provided by engineer. */
"%1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again." = "%1$@ ไม่สามารถอัพเดตได้ขณะที่เปิดใช้งานไฟล์อ่านอย่างเดียวจำนวนมากจากดิสก์อิมเมจหรือฮาร์ทไดร์ฟ ย้าย %1$@ ไปยังแฟ้มเอกสาร Applications แล้วอัพเดตจากที่นั่น และลองอีกครั้ง";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ เป็นเวอร์ชันใหม่ล่าสุดที่พร้อมให้ใช้งานในขณะนี้";

/* No comment provided by engineer. */
"%@ downloaded" = "ดาวน์โหลด %@ เรียบร้อยแล้ว";

/* No comment provided by engineer. */
"%@ of %@" = "%1$@ จาก %2$@";

/* Description text for SUUpdateAlert when the update is downloadable. */
"A new version of %@ is available. Update to %@ to experience the latest improvements." = "%1$@ เวอร์ชันใหม่พร้อมใช้งานแล้ว อัพเดตให้เป็น %2$@ เพื่อสัมผัสประสบการณ์ใหม่ล่าสุดของเรา";

/* Description text for SUUpdateAlert when the update informational with no download. */
"A new version of %@ is available. Update to %@ to experience the latest improvements. Would you like to learn more about this update on the web?" = "%1$@ เวอร์ชันใหม่พร้อมใช้งานแล้วในขณะนี้ อัพเดตเป็น %2$@ เพื่อสัมผัสประสบการณ์ใหม่ล่าสุดของเรา คุณต้องการอ่านเพิ่มเติมเกี่ยวกับอัพเดตนี้บนเวปหรือไม่?";

/* Automatic Update Alert Title (Normal Update) */
"A new version of %@ is ready to install!" = "%@ เวอร์ชันใหม่พร้อมให้ติดตั้งแล้ว!";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "เกิดข้อผิดพลาดขึ้นขณะกำลังเรียกข้อมูลการอัพเดต โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while downloading the update. Please try again later." = "เกิดข้อผิดพลาดขณะกำลังดาวน์โหลดอัพเดต โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "เกิดข้อผิดพลาดขณะกำลังแตกไฟล์ในคลังเอกสาร โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while installing the update. Please try again later." = "เกิดข้อผิดพลาดขณะกำลังติดตั้งอัพเดต โปรดลองอีกครั้งในภายหลัง";

/* No comment provided by engineer. */
"An error occurred while parsing the update feed." = "เกิดข้อผิดพลาดขณะกำลังวิเคราะห์ฟีดอัพเดต";

/* No comment provided by engineer. */
"An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@." = "เกิดข้อผิดพลาดขณะเปิดใช้งาน %1$@ อีกครั้ง แต่เวอร์ชันใหม่จะพร้อมใช้งานได้ในครั้งถัดไปที่คุณใช้งาน %1$@";

/* Automatic Update Alert Title (Critical Update) */
"An important update to %@ is ready to install" = "อัพเดตสำคัญสำหรับ %@ พร้อมติดตั้งแล้ว";

/* the unit for bytes */
"B" = "B";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* No comment provided by engineer. */
"Cancel Update" = "ยกเลิกการอัพเดต";

/* No comment provided by engineer. */
"Checking for updates..." = "กำลังตรวจสอบเพื่ออัพเดต...";

/* Take care not to overflow the status window. */
"Downloading update..." = "กำลังดาวน์โหลดอัพเดต...";

/* Take care not to overflow the status window. */
"Extracting update..." = "กำลังแตกไฟล์อัพเดต...";

/* the unit for gigabytes */
"GB" = "GB";

/* No comment provided by engineer. */
"Install and Relaunch" = "ติดตั้งและเปิดใช้งานอีกครั้ง";

/* Take care not to overflow the status window. */
"Installing update..." = "กำลังติดตั้งอัพเดต...";

/* the unit for kilobytes */
"KB" = "KB";

/* Alternate title for 'Install Update' button when there's no download in RSS feed. */
"Learn More..." = "ดูเพิ่มเติม...";

/* No comment provided by engineer. */
"Let's update your app" = "อัพเดตแอพฯ ของคุณกันเถอะ";

/* the unit for megabytes */
"MB" = "MB";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to Install" = "พร้อมที่จะติดตั้งแล้ว";

/* No comment provided by engineer. */
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "%1$@ ควรตรวจสอบอัตโนมัติก่อนทำการอัพเดตหรือไม่? คุณสามารถตรวจสอบได้ด้วยตัวเองก่อนทำการอัพเดตได้จากเมนู %1$@";

/* No comment provided by engineer. */
"The update is improperly signed." = "มีการลงชื่อไม่ถูกต้องในการอัพเดต";

/* No comment provided by engineer. */
"The update will not be installed because the user requested for the system to power off" = "อัพเดตไม่สามารถติดตั้งได้ เนื่องจากผู้ใช้ขอให้ปิดระบบ";

/* Automatic Update Alert Title (Forced Update) */
"Uh oh. Your version of %@ is out of date." = "โอ๊ะโอ เวอร์ชัน %@ ของคุณไม่อัพเดต";

/* No comment provided by engineer. */
"Update Error!" = "มีข้อผิดพลาดเกิดขึ้นขณะอัพเดต!";

/* No comment provided by engineer. */
"Updating %@" = "กำลังอัพเดต %@";

/* 'Error' message when the user checks for updates but is already current or the feed doesn't contain any updates. (not necessarily shown in UI) */
"You already have the newest version of %@." = "คุณมีเวอร์ชันใหม่ล่าสุดของ %@ แล้ว";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You're up-to-date!" = "คุณได้รับการอัพเดตแล้ว!";

/* Automatic Update Alert Description (Forced Update) */
"You’re currently on version %@ which is no longer supported. We’ve made a lot of improvements since then so please download the latest version to continue." = "คุณกำลังใช้งานเวอร์ชัน %@ ซึ่งปัจจุบันนี้ไม่ได้รองรับแล้ว เราได้ทำการแก้ไขปรับปรุงหลายสิ่งหลายอย่างแล้ว ดังนั้นกรุณาดาวน์โหลดเวอร์ชันล่าสุดเพื่อดำเนินการต่อ";
